# Homebrew packages to install
brew "bash-completion" if OS.mac? # Completion for Bash 3.2 which is the default on Mac
brew "bash-completion@2" if OS.linux? # Completion for Bash 4.2+
brew "bat"
brew "btop"
brew "cloc"
brew "coreutils" if OS.mac?
brew "dos2unix"
brew "fish"
brew "gh"
brew "git"
brew "git-delta"
brew "htop"
brew "lesspipe"
brew "loc"
brew "the_silver_searcher"
brew "vim"
brew "wget"

# gng - Gradle wrapper helper
# https://github.com/gdubw/gng
tap "gdubw/gng"